src/Documents/АвансовыйОтчет/АвансовыйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АвансовыйОтчет</name>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.Подотчет</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидОперацииАвансовогоОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьяДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
</mdclass:Document>

src/Enums/ВидОперацииАвансовогоОтчета/ВидОперацииАвансовогоОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидОперацииАвансовогоОтчета</name>
  <enumValues>
    <name>ОтчетЗаТоварыУслуги</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
</mdclass:Enum>

src/Documents/АвансовыйОтчет/ManagerModule.bsl
Функция Проведение ( Данные ) Экспорт
	
	получитьДанныеДокумента ( Данные );
	сформироватьПодотчет ( Данные );
	Если ( Данные.Шапка.ВидОперации = Перечисления.ВидОперацииАвансовогоОтчета.Возврат ) Тогда
		сформироватьДенежныеСредства ( Данные );	
		сформироватьДвиженияДенежныхСредств ( Данные );
	КонецЕсли; 
	установитьФлагиЗаписи ( Данные );
	Возврат ИСТИНА;
	
КонецФункции

Процедура получитьДанныеДокумента ( Данные )
	
	текст = "
	|// ~Шапка
	|ВЫБРАТЬ Ссылка как Ссылка, Номер как Номер, ДатаОперации как Период, ДатаОперации как ДатаОперации,
	|		 Касса как Касса, Описание как Описание, Сумма как Сумма, Сотрудник как Сотрудник,
	|		 Организация как Организация, Комментарий как Комментарий, Ответственный как Ответственный,
	|		 Валюта как Валюта, ВидОперации как ВидОперации, СтатьяДДС как СтатьяДДС
	|ИЗ 	 Документ.АвансовыйОтчет
	|ГДЕ	 Ссылка = &Ссылка
	|";
	запрос = Новый Запрос ( текст );
	запрос.УстановитьПараметр ( "Ссылка", Данные.Ссылка );
	Данные.Вставить ( "Шапка", запрос.Выполнить ().Выгрузить () [ 0 ] );

КонецПроцедуры 

Процедура сформироватьПодотчет ( Данные )
	
	движение = Данные.Движения.Подотчет.ДобавитьРасход ();
	движение.Период = Данные.Шапка.Период;
	движение.Сотрудник = Данные.Шапка.Сотрудник;
	движение.Валюта = Данные.Шапка.Валюта;
	движение.Сумма = Данные.Шапка.Сумма;
	
КонецПроцедуры

Процедура сформироватьДенежныеСредства ( Данные )
	
	движение = Данные.Движения.ДенежныеСредства.ДобавитьПриход ();
	движение.Период = Данные.Шапка.Период;
	движение.Казна = Данные.Шапка.Касса;
	движение.Валюта = Данные.Шапка.Валюта;
	движение.Сумма = Данные.Шапка.Сумма;
	
КонецПроцедуры

Процедура сформироватьДвиженияДенежныхСредств ( Данные )
	
	движение = Данные.Движения.ДвиженияДенежныхСредств.Добавить ();
	движение.Период = Данные.Шапка.Период;
	движение.Казна = Данные.Шапка.Касса;
	движение.Валюта = Данные.Шапка.Валюта;
	движение.Организация = Данные.Шапка.Организация;
	движение.СтатьяДДС = Данные.Шапка.СтатьяДДС;
	движение.СуммаПриход = Данные.Шапка.Сумма;
	движение.СуммаРасход = 0;
	
КонецПроцедуры

Процедура установитьФлагиЗаписи ( Данные )
	
	Данные.Движения.Подотчет.Записывать = ИСТИНА;
	Данные.Движения.ДенежныеСредства.Записывать = ИСТИНА;
	Данные.Движения.ДвиженияДенежныхСредств.Записывать = ИСТИНА;
	
КонецПроцедуры
